{
  "fields": [
    {
      "name": "LogGroupName",
      "type": "string",
      "description": "LogGroupName is the name of CloudWatch log group which defines group of log streams that share the same retention, monitoring, and access control settings.",
      "required": true,
      "mapstructureTag": "log_group_name"
    },
    {
      "name": "LogStreamName",
      "type": "string",
      "description": "LogStreamName is the name of CloudWatch log stream which is a sequence of log events that share the same source.",
      "required": true,
      "mapstructureTag": "log_stream_name"
    },
    {
      "name": "Namespace",
      "type": "string",
      "description": "Namespace is a container for CloudWatch metrics. Metrics in different namespaces are isolated from each other.",
      "required": true,
      "mapstructureTag": "namespace"
    },
    {
      "name": "RetainInitialValueOfDeltaMetric",
      "type": "bool",
      "description": "RetainInitialValueOfDeltaMetric is the flag to signal that the initial value of a metric is a valid datapoint. The default behavior is that the first value occurrence of a metric is set as the baseline for the calculation of the delta to the next occurrence. With this flag set to true the exporter will instead use this first value as the initial delta value. This is especially useful when handling low frequency metrics.",
      "required": true,
      "mapstructureTag": "retain_initial_value_of_delta_metric"
    },
    {
      "name": "DimensionRollupOption",
      "type": "string",
      "description": "DimensionRollupOption is the option for metrics dimension rollup. Three options are available, default option is \"ZeroAndSingleDimensionRollup\". \"ZeroAndSingleDimensionRollup\" - Enable both zero dimension rollup and single dimension rollup \"SingleDimensionRollupOnly\" - Enable single dimension rollup \"NoDimensionRollup\" - No dimension rollup (only keep original metrics which contain all dimensions)",
      "required": true,
      "mapstructureTag": "dimension_rollup_option"
    },
    {
      "name": "LogRetention",
      "type": "int64",
      "description": "LogRetention is the option to set the log retention policy for the CloudWatch Log Group. Defaults to Never Expire if not specified or set to 0 Possible values are 1, 3, 5, 7, 14, 30, 60, 90, 120, 150, 180, 365, 400, 545, 731, 1827, 2192, 2557, 2922, 3288, or 3653",
      "required": true,
      "mapstructureTag": "log_retention"
    }
  ],
  "imports": [
    "strings",
    "go.opentelemetry.io/collector/component",
    "go.uber.org/zap",
    "github.com/open-telemetry/opentelemetry-collector-contrib/internal/aws/awsutil",
    "github.com/open-telemetry/opentelemetry-collector-contrib/internal/aws/cwlogs",
    "github.com/open-telemetry/opentelemetry-collector-contrib/pkg/resourcetotelemetry"
  ],
  "packageName": "awsemfexporter"
}